In [2]:
# list comprehension

list_of_squares = []

for x in range (1,11):
    list_of_squares.append(x**2)
    
print(list_of_squares)

[1, 4, 9, 16, 25, 36, 49, 64, 81, 100]

In [3]:
list_of_squares = [x**2 for x in range (1,11)]
list_of_squares

[1, 4, 9, 16, 25, 36, 49, 64, 81, 100]

In [4]:
{x:x**2 for x in range(1,11)}

{1: 1, 2: 4, 3: 9, 4: 16, 5: 25, 6: 36, 7: 49, 8: 64, 9: 81, 10: 100}

In [5]:
# with an if statement
list_of_odd_squares = [x**2 for x in range(1,11) if x % 2 ==1]
list_of_odd_squares

[1, 9, 25, 49, 81]

In [6]:
# nested list comprehension
matrix=[[1,2,3],[4,5],[6,7,8,9]]

# Nested list comprehension to flatten a given 2-D matric
flatten_matrix = [val for sublist in matrix for val in sublist]

print(flatten_matrix)

[1, 2, 3, 4, 5, 6, 7, 8, 9]

## Introduction

#### Our goals today are to be able to: <br/>

- Investigate table data in Pandas
- Manipulate Pandas DataFrames

### Activation:

![excel2](img/excelpic2.jpg)

Most people have used Microsoft Excel or Google sheets. But what are the limitations of excel?

- [Take a minute to read this article](https://www.bbc.com/news/magazine-22223190)
- make a list of problems excel presents

How is using python different?

Python
- create documentation of processes as you code
- reduces chances for human error
- do "drag and drop"
- repeatable
- transparent

## Pandas

<img src="https://cdn-images-1.medium.com/max/1600/1*9IU5fBzJisilYjRAi-f55Q.png" width=600>  




- The data manipulation capabilities of Pandas are built on top of the numpy library.
- Pandas dataframe object represents a spreadsheet with cell values, column names, and row index labels.

### 1. Importing and reading data with Pandas!

#### Let's use pandas to read some csv files so we can interact with them.

In [7]:
# First, let's check which directory we are in so the files we expect to see are there.
!pwd
!ls -la

/Users/kcahlers/Documents/HBS/Data Science School/hbs-ds-060120/module-1/day-5-pandas-1
total 48
drwxr-xr-x   6 kcahlers  staff    192 Jun  5 09:46 .
drwxr-xr-x  11 kcahlers  staff    352 Jun  5 09:33 ..
drwxr-xr-x   3 kcahlers  staff     96 Jun  5 09:40 .ipynb_checkpoints
drwxr-xr-x   4 kcahlers  staff    128 Jun  5 09:33 data
drwxr-xr-x  12 kcahlers  staff    384 Jun  5 09:33 img
-rwxr-xr-x   1 kcahlers  staff  22496 Jun  5 09:46 pandas-1.ipynb

In [9]:
!ls -la data

total 16
drwxr-xr-x  4 kcahlers  staff  128 Jun  5 09:33 .
drwxr-xr-x  6 kcahlers  staff  192 Jun  5 09:46 ..
-rw-r--r--  1 kcahlers  staff   62 Jun  5 09:33 example1.csv
-rw-r--r--  1 kcahlers  staff  238 Jun  5 09:33 made_up_jobs.csv

In [10]:
import pandas as pd

example_csv = pd.read_csv('data/example1.csv')

In [11]:
example_csv
# row labels 0 and 1 are index

     Title1    Title2    Title3
0       one       two     three
1  example1  example2  example3

In [12]:
!cat data/example1.csv

Title1,Title2,Title3
one,two,three
example1,example2,example3

In [13]:
type(example_csv)

pandas.core.frame.DataFrame

In [14]:
example_csv.Title1

0         one
1    example1
Name: Title1, dtype: object

In [15]:
type(example_csv.Title1)

pandas.core.series.Series

There is also `read_excel`, `read_html`, and many other pandas `read_` functions.  
http://pandas.pydata.org/pandas-docs/stable/user_guide/io.html

In [16]:
example_csv.describe()

          Title1 Title2    Title3
count          2      2         2
unique         2      2         2
top     example1    two  example3
freq           1      1         1

In [17]:
example_csv.info()
# object = string

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Title1  2 non-null      object
 1   Title2  2 non-null      object
 2   Title3  2 non-null      object
dtypes: object(3)
memory usage: 176.0+ bytes

Try loading in the example file in the `data` directory called `made_up_jobs.csv` using pandas.

In [18]:
# read in your csv here!
muj = pd.read_csv('data/made_up_jobs.csv')

# remember that it's nice to be able to look at your data, so let's do that here, too.
muj.head()

   ID           Name                       Job  Years Employed
0   0   Bob Bobberty  Underwater Basket Weaver              13
1   1   Susan Smells             Salad Spinner               5
2   2  Alex Lastname      Productivity Manager               2
3   3        Rudy P.                Being cool              55
4   4        Rudy G.  Being compared to Rudy P              50

In [20]:
muj.info()
#int64 means im on a 64 bit comp for ineger
# i have 6 rows

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   ID              6 non-null      int64
 1   Name            6 non-null      object
 2   Job             6 non-null      object
 3   Years Employed  6 non-null      int64
dtypes: int64(2), object(2)
memory usage: 320.0+ bytes

In [21]:
muj

   ID            Name                       Job  Years Employed
0   0    Bob Bobberty  Underwater Basket Weaver              13
1   1    Susan Smells             Salad Spinner               5
2   2   Alex Lastname      Productivity Manager               2
3   3         Rudy P.                Being cool              55
4   4         Rudy G.  Being compared to Rudy P              50
5   5  Sir Wellington            Cheese Stacker              10

In [55]:
muj.Name

0      Bob Bobberty
1      Susan Smells
2     Alex Lastname
3           Rudy P.
4           Rudy G.
5    Sir Wellington
Name: Name, dtype: object

In [57]:
muj['Name']

0      Bob Bobberty
1      Susan Smells
2     Alex Lastname
3           Rudy P.
4           Rudy G.
5    Sir Wellington
Name: Name, dtype: object

In [22]:
import numpy as np

In [28]:
random_df = pd.DataFrame(np.random.random([1000,10]))

In [27]:
random_df.head()

,0,1,2,3,4,5,6,7,8,9
0,0.931830,0.854617,0.673295,0.737343,0.648238,0.960378,0.505828,0.009317,0.223691,0.498597
1,0.804072,0.051147,0.580755,0.663130,0.449221,0.673747,0.258458,0.806711,0.547213,0.925510
2,0.161104,0.282623,0.202492,0.392145,0.031912,0.670953,0.133902,0.054683,0.969201,0.789597
3,0.284786,0.787721,0.160922,0.079175,0.681994,0.678143,0.699781,0.159985,0.712177,0.953571
4,0.585690,0.926379,0.538088,0.310188,0.718088,0.160827,0.102686,0.386788,0.582066,0.601536

In [29]:
random_df.head(10)

,0,1,2,3,4,5,6,7,8,9
0,0.569815,0.381992,0.446940,0.250501,0.674489,0.198632,0.238488,0.959084,0.124074,0.306539
1,0.311844,0.619643,0.774517,0.428708,0.311081,0.991387,0.183114,0.082427,0.459267,0.620568
2,0.010310,0.529921,0.688699,0.799839,0.799236,0.754900,0.242619,0.478305,0.711980,0.991636
3,0.224320,0.443984,0.952625,0.379138,0.457226,0.423409,0.496870,0.482241,0.190656,0.839800
4,0.979493,0.581462,0.688273,0.665142,0.774317,0.461760,0.319605,0.781959,0.253307,0.061438
5,0.974853,0.464195,0.678263,0.483655,0.274475,0.711446,0.215003,0.304432,0.893671,0.688288
6,0.779971,0.056362,0.079081,0.981521,0.490127,0.588040,0.512643,0.301106,0.823300,0.915927
7,0.054208,0.582739,0.998831,0.950023,0.770784,0.119136,0.142338,0.920561,0.470405,0.614705
8,0.855537,0.634875,0.518357,0.378814,0.193299,0.229301,0.329421,0.244439,0.709396,0.250516
9,0.755389,0.312911,0.660857,0.269043,0.971453,0.632345,0.330944,0.806650,0.757632,0.555145

In [30]:
random_df.tail(10)

,0,1,2,3,4,5,6,7,8,9
990,0.547941,0.007531,0.741292,0.951701,0.526582,0.092625,0.776698,0.546270,0.313134,0.083889
991,0.668864,0.870629,0.287505,0.504348,0.658764,0.122618,0.535731,0.626501,0.770888,0.430808
992,0.285577,0.971720,0.859793,0.867952,0.126906,0.672722,0.982938,0.327140,0.701664,0.502127
993,0.379160,0.585727,0.911518,0.857180,0.217767,0.487620,0.743326,0.431654,0.738374,0.198554
994,0.484533,0.875937,0.308296,0.049100,0.901036,0.011977,0.202463,0.467190,0.560447,0.181915
995,0.569580,0.196209,0.335802,0.874105,0.064970,0.878375,0.586366,0.584659,0.930046,0.944167
996,0.806898,0.854371,0.084062,0.806797,0.164035,0.214155,0.368781,0.136252,0.141726,0.075040
997,0.505398,0.160259,0.196256,0.218393,0.133211,0.486376,0.416908,0.503435,0.220003,0.203556
998,0.327126,0.794796,0.210612,0.022199,0.568579,0.502194,0.944579,0.298866,0.209596,0.657323
999,0.430882,0.275615,0.509340,0.064381,0.977909,0.870750,0.158735,0.224528,0.629495,0.822157

In [31]:
random_df.size

10000

In [32]:
pd.DataFrame([1,2,3],[4,None,6])

     0
4    1
NaN  2
6    3

### 2. Utilizing and identifying Pandas objects

- What is a DataFrame object and what is a Series object? 
- How are they different from Python lists?

These are questions we will cover in this section. To start, let's start with this list of fruits.

In [33]:
fruits = ['Apple', 'Orange', 'Watermelon', 'Lemon', 'Mango']

print(fruits)

['Apple', 'Orange', 'Watermelon', 'Lemon', 'Mango']

In [34]:
[x.upper() for x in fruits]

['APPLE', 'ORANGE', 'WATERMELON', 'LEMON', 'MANGO']

Using our list of fruits, we can create a pandas object called a 'series' which is much like an array or a vector.

In [35]:
fruits_series = pd.Series(fruits)

print(fruits_series)
type(fruits_series)

0         Apple
1        Orange
2    Watermelon
3         Lemon
4         Mango
dtype: object

pandas.core.series.Series

One difference between python **list objects** and pandas **series objects** is the fact that you can define the index manually for a **series objects**.

In [36]:
ind = ['a', 'b', 'c', 'd', 'e']

fruits_series = pd.Series(fruits, index=ind)

print(fruits_series)

a         Apple
b        Orange
c    Watermelon
d         Lemon
e         Mango
dtype: object

With a partner, create your own custom series from a list of lists.

In [37]:
list_of_lists = [['cat'], ['dog'], ['horse'], ['cow'], ['macaw']]

# create custom indices for your series
ind = ['a', 'b', 'c', 'd', 'e']

elements=[x[0].lower() for x in list_of_lists]

# create the series using your list objects
# You can use either a for loop or also pd.Series
list_of_lists_series = pd.Series(elements, index=ind)

# print your series
print(list_of_lists_series)
type(list_of_lists_series)

#precursor to join  in SQL

a      cat
b      dog
c    horse
d      cow
e    macaw
dtype: object

pandas.core.series.Series

We can do a simliar thing with Python dictionaries. This time, however, we will create a DataFrame object from a python dictionary.

In [52]:
# Dictionary with list object in values
student_dict = {
    'name': ['Samantha', 'Alex', 'Dante'],
    'age': ['35', '17', '26'],
    'city': ['Houston', 'Seattle', 'New york']
}

student_dict.keys()

dict_keys(['name', 'age', 'city'])

In [53]:
students_df = pd.DataFrame(student_dict)

students_df.head()

       name age      city
0  Samantha  35   Houston
1      Alex  17   Seattle
2     Dante  26  New york

In [43]:
student_list = [
    {'name':"Samantha",'age':'35','city':'Houston'},
    {'name':"Alex",'age':'17','city':'Seattle'},
]

pd.DataFrame(student_list)

       name age     city
0  Samantha  35  Houston
1      Alex  17  Seattle

In [44]:
#to find data types of columns
students_df.dtypes

name    object
age     object
city    object
dtype: object

In [45]:
students_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    3 non-null      object
 1   age     3 non-null      object
 2   city    3 non-null      object
dtypes: object(3)
memory usage: 200.0+ bytes

Let's change the data type of ages to int.

In [54]:
# We can also change a columns type but the change has to make sense.
#students_df.age = students_df.age.values

#Uncomment line below and observe what happens when trying to convert student's name to int or float
students_df.age = students_df.age.astype(int)

#How about what happens converting numeric to string
#students_df.age = students_df.age.astype(str)

students_df.dtypes

name    object
age      int64
city    object
dtype: object

We can also use a custom index for these items. For example, we might want them to be the individual student ID numbers.

In [58]:
school_ids = ['1111', '1145', '0096']

# Notice here we use pd.DataFrame not pd.Series as we did for a pandas series.
students_df = pd.DataFrame(student_dict, index=school_ids)

students_df.head()

          name age      city
1111  Samantha  35   Houston
1145      Alex  17   Seattle
0096     Dante  26  New york

In [59]:
students_df.index=students_df.index.rename('id')
students_df

          name age      city
id
1111  Samantha  35   Houston
1145      Alex  17   Seattle
0096     Dante  26  New york

In [60]:
students_df.columns

Index(['name', 'age', 'city'], dtype='object')

Using Pandas, we can also rename column names.

In [61]:
students_df.columns = ['NAME', 'AGE', 'HOME']
# same as students_df.columns=[x.upper() for x in students_df.columns]
students_df.head()

          NAME AGE      HOME
id
1111  Samantha  35   Houston
1145      Alex  17   Seattle
0096     Dante  26  New york

Or, we can also change the column names using the rename function.

In [62]:
students_df.rename(columns={"AGE": "YEARS"})

          NAME YEARS      HOME
id
1111  Samantha    35   Houston
1145      Alex    17   Seattle
0096     Dante    26  New york

In [63]:
# Notice what happens when we print students_df

students_df

          NAME AGE      HOME
id
1111  Samantha  35   Houston
1145      Alex  17   Seattle
0096     Dante  26  New york

In [64]:
# If you want the file to save over itself, use the option `inplace = True`.
students_df.rename(columns={'AGE': 'YEARS'}, inplace=True)
# could also do students_df=students_df.rename(...)
# inplace is "bad" so do it the above way to save the rename changes
students_df.head()

          NAME YEARS      HOME
id
1111  Samantha    35   Houston
1145      Alex    17   Seattle
0096     Dante    26  New york

Similarly, there is a tool to remove rows and columns from your DataFrame

In [65]:
students_df.drop(columns=['YEARS', 'HOME'])

          NAME
id
1111  Samantha
1145      Alex
0096     Dante

In [66]:
#Notice again what happens if we print students_df 
students_df

          NAME YEARS      HOME
id
1111  Samantha    35   Houston
1145      Alex    17   Seattle
0096     Dante    26  New york

In [68]:
skinny_df = students_df.drop(columns=['YEARS', 'HOME'], inplace=True)
skinny_df

KeyError: "['YEARS' 'HOME'] not found in axis"

If you want the file to save over itself, use the option `inplace = True`.

Every function has options. Let's read more about `drop` [here](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.drop.html)

In [ ]:
# also students_df = students_df.drop([1],axis=0)
#students_df.index = students_df.index.rename('Kaitlin Index')

In [72]:
my_df = pd.DataFrame([[1,2,3],[4,None,6]])
my_df

   0    1  2
0  1  2.0  3
1  4  NaN  6

In [74]:
my_df.dropna()
#drops rows with NA (missing vlaues)

   0    1  2
0  1  2.0  3

### 3. Filtering Data Using Pandas
There are several ways to grab particular data from a DataFrame. 
- Python lists allow for selection of data only through integer location. 
- You can use a single integer or slice notation to make the selection but NOT a list of integers.
- Dictionaries only allow selection with a single label. Slices and lists of labels are not allowed.

In [78]:
l = [1, 2, 3, 4, 5]
l[0:3]
# l[[0,3]] doesn't work

[1, 2, 3]

### DataFrames can be indexed by column name (label) or row name (index) or by position.   
#### The `.loc` method is used for indexing by name.  
#### While `.iloc` is used for indexing by number.

In [81]:
student_dict = {
    'name': ['Samantha', 'Alex', 'Dante'],
    'age': ['35', '17', '26'],
    'city': ['Houston', 'Seattle', 'New york']
}

students_df = pd.DataFrame(student_dict)

In [85]:
students_df.loc[0:1,"age":"city"]
# if you dropped row 1 then this same line would just show 0, 35, Houston
# doesnt delete and move cells up like excel 
# index 2 stays in index 2

  age     city
0  35  Houston
1  17  Seattle

### Let's take a look at `.iloc`
#### `.iloc` takes slices based on index position.
#### `.iloc` stands for integer location so that should help with remember what it does
#### `.iloc`[row , column]

In [86]:
# returns the first row
students_df.iloc[0]
#returns as a series object

name    Samantha
age           35
city     Houston
Name: 0, dtype: object

In [87]:
# returns the first column
students_df.iloc[:, 0]

0    Samantha
1        Alex
2       Dante
Name: name, dtype: object

In [88]:
# returns first two rows notice that ILOC performs regular python slicing.
students_df.iloc[0:2]

       name age     city
0  Samantha  35  Houston
1      Alex  17  Seattle

In [91]:
students_df.loc[0:2]
# loc is inclusive of the 2 iloc is exclusive

       name age      city
0  Samantha  35   Houston
1      Alex  17   Seattle
2     Dante  26  New york

In [89]:
# returns the first two columns
students_df.iloc[:, 0:2]

       name age
0  Samantha  35
1      Alex  17
2     Dante  26

In [90]:
# returns first row and columns 1 and 2
students_df.iloc[0:1, 0:2]
# 1 row 2 cols

       name age
0  Samantha  35

### How would we use `.iloc` to return the last item in the last row?

In [96]:
students_df.iloc[-1,-1]
#students_df.iloc[-1] gives last row
#students_df.iloc[:,-1] gives last row

0     Houston
1     Seattle
2    New york
Name: city, dtype: object

### How would we use `.iloc` to return the last item in the last column?

In [ ]:
# return the last item in the last column using iloc
students_df.iloc[-1,-1]

### What if we only want certain columns or rows?

In [97]:
# Don't do students_df.iloc[0, 2]
students_df.iloc[[0, 2]]

       name age      city
0  Samantha  35   Houston
2     Dante  26  New york

In [98]:
students_df.iloc[[0, 2], [0, 2]]

       name      city
0  Samantha   Houston
2     Dante  New york

### Let's take a look at `.loc`
#### Label based method. 
#### Names or labels of the index is used when taking slices.
#### Also supports boolean subsetting.

In [ ]:
# We will use loc to return rows and columns based on labels. Let's look at the students_df DataFrame again.
students_df

In [99]:
# returns the student information associated with index 0
students_df.loc[0]

#by name not by position - the index

name    Samantha
age           35
city     Houston
Name: 0, dtype: object

In [101]:
# returns the student information for row index 0 to 2 inclusive.
# note iloc would return normal python slicing not including 2 as demonstrated above.
students_df.loc[0:2]
#inclusive

       name age      city
0  Samantha  35   Houston
1      Alex  17   Seattle
2     Dante  26  New york

In [102]:
# returns the column labeled 'age'
students_df.loc[:, 'age']
#every row only age

0    35
1    17
2    26
Name: age, dtype: object

In [103]:
# returns the column labeled 'age' and index values 1 to 2.
# gives us the values of the rows with index from 1 to 2 (inclusive)
# and columns labeled age"
students_df.loc[1:2, 'age']

1    17
2    26
Name: age, dtype: object

In [ ]:
# returns the column labeled 'age' and index values 1 to 2.
# gives us the values of the rows with index from 1 to 2 (inclusive)
# and columns labeled age to city (inclusive)"
students_df.loc[1:2, 'age':'city']

In [104]:
# What should we get?
students_df.loc[1:2, ['name', 'city']]
#rows 1 and 2 and cols name and city

    name      city
1   Alex   Seattle
2  Dante  New york

In [105]:
# How about?
students_df.loc[[0, 2], ['name', 'city']]

       name      city
0  Samantha   Houston
2     Dante  New york

In [106]:
# if index rearranged
school_ids = ['5', '11', '3']
students_df = pd.DataFrame(student_dict, index=school_ids)

In [107]:
students_df

        name age      city
5   Samantha  35   Houston
11      Alex  17   Seattle
3      Dante  26  New york

In [111]:
# What should we get now?
students_df.loc[['3':'11'], ['name', 'city']]
# wont work because cant read that way
# cant do [0:5] because strings not numbers
# ['5':'3'] works though
# searching off index

SyntaxError: invalid syntax (<ipython-input-111-543e4873a0d2>, line 2)

In [112]:
students_df.iloc[0:2]
#works because searching off position

        name age     city
5   Samantha  35  Houston
11      Alex  17  Seattle

In [113]:
# What should we get now?
students_df.loc[['5', '11'], ['name', 'city']]

        name     city
5   Samantha  Houston
11      Alex  Seattle

In [114]:
students_df.set_index("name", inplace=True)
students_df

         age      city
name
Samantha  35   Houston
Alex      17   Seattle
Dante     26  New york

In [115]:
students_df.loc[['Samantha']]

         age     city
name
Samantha  35  Houston

In [116]:
# Subsetting nonconsecutive rows
students_df.loc[['Samantha', 'Dante']]

         age      city
name
Samantha  35   Houston
Dante     26  New york

In [117]:
# Samantha to the end
students_df.loc['Samantha':]

         age      city
name
Samantha  35   Houston
Alex      17   Seattle
Dante     26  New york

In [120]:
students_df.reset_index().set_index('name').loc[:,'index':'age']

Empty DataFrame
Columns: []
Index: [Samantha, Alex, Dante]

In [ ]:
# return the first and last rows using one loc command

### Boolean Subsetting

In [121]:
student_dict = {
    'name': ['Samantha', 'Alex', 'Dante', 'Samantha'],
    'age': ['35', '17', '26', '21'],
    'city': ['Houston', 'Seattle', 'New york', 'Atlanta'],
    'state': ['Texas', 'Washington', 'New York', 'Georgia']
}

students_df = pd.DataFrame(student_dict)

In [122]:
# The statement data[name] == Samantha] produces a Pandas Series with a True/False value for every row
# in the data DataFrame, where there are True values for the rows where the name is Samantha.
# These type of boolean arrays can be passed directly to the .loc indexer.
students_df.loc[students_df['name'] == 'Samantha']

       name age     city    state
0  Samantha  35  Houston    Texas
3  Samantha  21  Atlanta  Georgia

In [123]:
# What about if we only want the city and state of the selected students with the name Samantha?
students_df.loc[students_df['name'] == 'Samantha', ['city', 'state']]

      city    state
0  Houston    Texas
3  Atlanta  Georgia

In [124]:
# What amount if we want to select a student of a specific age?
students_df.loc[students_df['age'] == '21']
# or students_df.loc[students_df.age == '21']

       name age     city    state
3  Samantha  21  Atlanta  Georgia

In [127]:
# What amount if we want to select a student of a specific age?
students_df.loc[(students_df['age'] == '21') &
                (students_df['city'] == 'Atlanta')]

       name age     city    state
3  Samantha  21  Atlanta  Georgia

In [126]:
# What should be returned?
students_df.loc[(students_df['age'] == '35') &
                (students_df['city'] == 'Atlanta')]

Empty DataFrame
Columns: [name, age, city, state]
Index: []